# ReuseLocalPlacement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..ReuseLocalPlacement Property
IFCExtrusionCreationData Class See Also
---
Allows re-use of local placement when creating a new local placement due to shifting of breps when moving towards the origin.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ReuseLocalPlacement { get; set; }
```

Visual Basic
---
```text
Public Property ReuseLocalPlacement As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ReuseLocalPlacement {
	bool get ();
	void set (bool value);
}
```

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace